tylertms/dspic33e-sim/conformance/oscillator.c
    dspic33_load_program_word(source, 0u, OPCODE_MOV_W0_W1);
    source->pc = 0u;
    dspic33_set_working_register(source, 0u, 0x8900u);
    dspic33_set_working_register(source, 1u, REFERENCE_CLOCK_CONTROL);
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING &&
               dspic33_read_word(source, REFERENCE_CLOCK_CONTROL) == 0x8700u,
           "stepped word write preserves enabled divisor");

    dspic33_set_working_register(source, 0u, 0x0900u);
    source->pc = 0u;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING &&
               dspic33_read_word(source, REFERENCE_CLOCK_CONTROL) == 0x0700u,
           "stepped disable preserves enabled divisor");
    dspic33_set_working_register(source, 0u, 0x0900u);
    source->pc = 0u;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING &&
               dspic33_read_word(source, REFERENCE_CLOCK_CONTROL) == 0x0900u,
           "stepped disabled write changes divisor");

    expect(state, dspic33_copy(copy, source), "copy preserves reference clock state");
    expect(state, dspic33_read_word(copy, REFERENCE_CLOCK_CONTROL) == 0x0900u,
           "copy retains reference clock divisor");
    dspic33_load_program_word(source, 0u, OPCODE_RESET);
    source->pc = 0u;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING &&
               dspic33_read_word(source, REFERENCE_CLOCK_CONTROL) == 0u,
           "warm reset clears reference clock control");
    dspic33_reset(copy, 0u);
    expect(state, dspic33_read_word(copy, REFERENCE_CLOCK_CONTROL) == 0u,
           "cold reset clears copied reference clock control");
    expect(state,
           source->events.count == 0u && !source->oscillator.active &&
               copy->events.count == 0u && !copy->oscillator.active,
           "reference clock writes create no oscillator lifecycle");
}

static void main_pll_configuration_cases(OscillatorConformance* state, Dspic33* source,
                                         Dspic33* copy) {
    uint32_t generation;
    uint64_t deadline;

    dspic33_load_configuration_word(source, CONFIGURATION_FOSC, 0x005eu);
    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_CLOCK_LOCK);
    generation = source->oscillator.generation;
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0xffffu);
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0xffffu);
    dspic33_write_word(source, MAIN_OSCILLATOR_TUNING, 0xffffu);
    expect(state,
           dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0x3040u &&
               dspic33_read_word(source, MAIN_PLL_FEEDBACK) == 0x0030u &&
               dspic33_read_word(source, MAIN_OSCILLATOR_TUNING) == 0u,
           "effective CLKLOCK rejects main PLL word writes");
    dspic33_write_byte(source, MAIN_CLOCK_DIVISOR, 0x1fu);
    dspic33_write_byte(source, MAIN_CLOCK_DIVISOR + 1u, 0x07u);
    dspic33_write_byte(source, MAIN_PLL_FEEDBACK, 0xffu);
    dspic33_write_byte(source, MAIN_PLL_FEEDBACK + 1u, 0x01u);
    dspic33_write_byte(source, MAIN_OSCILLATOR_TUNING, 0x3fu);
    expect(state,
           dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0x3040u &&
               dspic33_read_word(source, MAIN_PLL_FEEDBACK) == 0x0030u &&
               dspic33_read_word(source, MAIN_OSCILLATOR_TUNING) == 0u,
           "effective CLKLOCK rejects main PLL byte writes");
    expect(state,
           source->oscillator.generation == generation && source->events.count == 0u,
           "rejected main PLL writes preserve oscillator lifecycle");

    expect(state, program_fosc(source, 0x001eu),
           "FCKSM zero-zero immediately unlocks clock configuration");
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x071fu);
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x01ffu);
    dspic33_write_word(source, MAIN_OSCILLATOR_TUNING, 0x003fu);
    expect(state,
           dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0x071fu &&
               dspic33_read_word(source, MAIN_PLL_FEEDBACK) == 0x01ffu &&
               dspic33_read_word(source, MAIN_OSCILLATOR_TUNING) == 0x003fu,
           "FCKSM zero-zero permits clock configuration with CLKLOCK set");
    expect(state,
           source->oscillator.generation == generation && !source->oscillator.active &&
               !source->oscillator.lock_pending && source->events.count == 0u,
           "non-PLL configuration writes create no relock lifecycle");
    expect(state, program_fosc(source, 0x00deu),
           "FCKSM one-one immediately locks clock configuration");
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0030u);
    expect(state, dspic33_read_word(source, MAIN_PLL_FEEDBACK) == 0x01ffu,
           "FCKSM one-one enforces CLKLOCK");
    expect(state, program_fosc(source, 0x009eu),
           "FCKSM one-zero immediately unlocks clock configuration");
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0030u);
    expect(state, dspic33_read_word(source, MAIN_PLL_FEEDBACK) == 0x0030u,
           "FCKSM one-zero permits clock configuration with CLKLOCK set");

    expect(state, select_locked_main_pll(source, 1u),
           "select stable FRCPLL for relock cases");
    generation = source->oscillator.generation;
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0031u);
    expect(state,
           control(source) == 0x1100u && source->oscillator.lock_pending &&
               !source->oscillator.active &&
               source->oscillator.generation == generation + 1u &&
               source->events.count == 1u && source->events.items[0].source == 2u,
           "FRCPLL feedback change restarts lock");
    expect(state, dspic33_device_advance(source, 31u) && control(source) == 0x1100u,
           "FRCPLL feedback remains unlocked before new deadline");
    expect(state, dspic33_device_advance(source, 1u) && control(source) == 0x1120u,
           "FRCPLL feedback relocks at new deadline");

    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x3041u);
    expect(state, control(source) == 0x1100u && source->oscillator.lock_pending,
           "FRCPLL prescaler change restarts lock");
    expect(state, dspic33_device_advance(source, 32u) && control(source) == 0x1120u,
           "FRCPLL prescaler relocks");
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x3141u);
    expect(state, control(source) == 0x1100u && source->oscillator.lock_pending,
           "FRCPLL input divider change restarts lock");
    expect(state, dspic33_device_advance(source, 32u) && control(source) == 0x1120u,
           "FRCPLL input divider relocks");
    dspic33_write_word(source, MAIN_OSCILLATOR_TUNING, 0x0001u);
    expect(state, control(source) == 0x1100u && source->oscillator.lock_pending,
           "FRCPLL tuning change restarts lock");
    expect(state, dspic33_device_advance(source, 32u) && control(source) == 0x1120u,
           "FRCPLL tuning relocks");

    generation = source->oscillator.generation;
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x3101u);
    expect(state,
           control(source) == 0x1120u && source->oscillator.generation == generation &&
               source->events.count == 0u,
           "FRCPLL postscaler change preserves lock");
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x0101u);
    expect(state,
           control(source) == 0x1120u && source->oscillator.generation == generation &&
               source->events.count == 0u,
           "FRCPLL DOZE field change preserves PLL lock");

    expect(state, select_locked_main_pll(source, 3u),
           "select stable POSCPLL for relock cases");
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0031u);
    expect(state, control(source) == 0x3300u && source->oscillator.lock_pending,
           "POSCPLL feedback change restarts lock");
    expect(state, dspic33_device_advance(source, 32u) && control(source) == 0x3320u,
           "POSCPLL feedback relocks");
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x3041u);
    expect(state, control(source) == 0x3300u && source->oscillator.lock_pending,
           "POSCPLL prescaler change restarts lock");
    expect(state, dspic33_device_advance(source, 32u) && control(source) == 0x3320u,
           "POSCPLL prescaler relocks");
    generation = source->oscillator.generation;
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x3141u);
    dspic33_write_word(source, MAIN_OSCILLATOR_TUNING, 0x0001u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x3101u);
    expect(state,
           control(source) == 0x3320u && source->oscillator.generation == generation &&
               source->events.count == 0u,
           "POSCPLL irrelevant fields preserve lock");

