tylertms/dspic33e-sim/conformance/oscillator.c
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0033u);
    dspic33_reset(source, 0u);
    expect(state,
           control(source) == 0u && !source->oscillator.lock_pending &&
               source->events.count == 0u &&
               dspic33_read_word(source, MAIN_PLL_FEEDBACK) == 0x0030u,
           "cold reset cancels relock and restores PLL configuration");

    expect(state, select_locked_main_pll(source, 1u),
           "select FRCPLL for relock schedule failure");
    source->device_cycles = UINT64_MAX;
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0031u);
    expect(state,
           source->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
               control(source) == 0x1100u && source->oscillator.lock_pending &&
               source->events.count == 0u,
           "main PLL relock schedule failure is explicit and deterministic");

    dspic33_load_configuration_word(source, CONFIGURATION_FOSCSEL, 0x0078u);
    dspic33_load_configuration_word(source, CONFIGURATION_FOSC, 0x005eu);
    dspic33_load_configuration_word(source, CONFIGURATION_FWDT, 0x00ffu);
}

static void lifecycle_cases(OscillatorConformance* state, Dspic33* source,
                            Dspic33* copy) {
    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 10u);
    expect(state, dspic33_copy(copy, source), "copy preserves oscillator state");
    expect(state,
           copy->oscillator.active &&
               copy->oscillator.generation == source->oscillator.generation,
           "copy preserves active oscillator generation");
    expect(state, copy->events.count == source->events.count,
           "copy preserves pending oscillator event");
    expect(state, dspic33_device_advance(source, 22u) && control(source) == 0x3320u,
           "source completes copied switch interval");
    expect(state, dspic33_device_advance(copy, 22u) && control(copy) == 0x3320u,
           "copy independently completes switch interval");

    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 10u);
    dspic33_load_program_word(source, 0u, OPCODE_RESET);
    source->pc = 0u;
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "warm reset executes during oscillator switch");
    expect(state, control(source) == 0x0301u && source->oscillator.active,
           "warm reset preserves active oscillator switch");
    expect(state, source->events.count == 1u,
           "warm reset reconstructs pending oscillator event");
    expect(state, source->events.items[0].cycle - source->device_cycles == 20u,
           "warm reset preserves remaining oscillator interval");
    expect(state, dspic33_device_advance(source, 19u) && control(source) == 0x0301u,
           "warm-reset switch remains pending before preserved deadline");
    expect(state, dspic33_device_advance(source, 1u) && control(source) == 0x3320u,
           "warm-reset switch completes at preserved deadline");

    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 10u);
    dspic33_reset(source, 0u);
    expect(state, control(source) == 0u, "POR resets OSCCON from configuration");
    expect(state, !source->oscillator.active && source->events.count == 0u,
           "POR cancels pending oscillator switch");
    expect(state, dspic33_device_advance(source, 32u) && control(source) == 0u,
           "POR prevents stale oscillator completion");

    dspic33_reset(source, 0u);
    source->device_cycles = UINT64_MAX;
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state, source->stop_reason == DSPIC33_EVENT_QUEUE_ERROR,
           "switch schedule overflow reports event error");
    expect(state, control(source) == 0x0301u && source->events.count == 0u,
           "failed schedule leaves requested switch state visible");

    dspic33_reset(source, 0u);
    load_sequence(source, OPCODE_MOV_BYTE_W2_W1, OPCODE_RESET, OPCODE_MOV_BYTE_W3_W1);
    dspic33_load_program_word(source, 0x0026u, OPCODE_MOV_BYTE_W0_W1);
    source->pc = 0x0020u;
    dspic33_set_working_register(source, 0u, 0x40u);
    dspic33_set_working_register(source, 1u, OSCILLATOR_CONTROL);
    dspic33_set_working_register(source, 2u, 0x46u);
    dspic33_set_working_register(source, 3u, 0x57u);
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "reset invalidation first key executes");
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "reset executes between protected keys");
    source->pc = 0x0024u;
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "post-reset second key executes");
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "post-reset final write executes");
    expect(state, (control(source) & OSCILLATOR_IO_LOCK) == 0u,
           "reset invalidates protected key sequence");
}

int main(void) {
    Dspic33 source;
    Dspic33 copy;
    OscillatorConformance state = {0u, 0u, 0u};
    if (!dspic33_initialize(&source) || !dspic33_initialize(&copy)) {
        fprintf(stderr, "failed to initialize simulator\n");
        return 2;
    }
    dspic33_load_configuration_word(&source, 0xf80008u, 0x005eu);
    reset_cases(&state, &source);
    protection_cases(&state, &source);
    switch_cases(&state, &source);
    failure_trap_cases(&state, &source);
    configuration_admission_cases(&state, &source);
    hardware_failure_cases(&state, &source);
    pll_lock_sequence_cases(&state, &source, &copy);
    two_speed_startup_cases(&state, &source, &copy);
    reference_clock_cases(&state, &source, &copy);
    main_pll_configuration_cases(&state, &source, &copy);
    lifecycle_cases(&state, &source, &copy);
    expect(&state, state.cases == 276u, "oscillator assertion arithmetic");
    printf("[oscillator-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32
           "\n",
           state.cases, state.passed, state.failed);
    dspic33_destroy(&copy);
    dspic33_destroy(&source);
    return state.failed == 0u ? 0 : 1;
}
